app/controllers/publications_controller.rb

INSERT INTO "publications" ("title", "description", "value", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dsd"], ["description", "dsd"], ["value", 200], ["created_at", "2021-12-03 00:14:32.884599"], ["updated_at", "2021-12-03 00:14:32.884599"], ["user_id", 2]]
---
  def create

    @publication = Publication.new(publication_params)
    #publicaciones pertenece a un usuario, por que lo necesita un id de usuarios
    #por lo que le pasamos el id del usuario que esta esta creando la publicacion
    #o sea, current_user
    @publication.user = current_user
    respond_to do |format|
      if @publication.save!

UPDATE "publications" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "publications"."id" = ?  [["title", "Cursos de Musica"], ["description", "Curso de musica teoria musical"], ["updated_at", "2021-12-05 20:30:55.512801"], ["id", 21]]
---
  def update
    respond_to do |format|
      if @publication.update(publication_params)

DELETE FROM "publications" WHERE "publications"."id" = ?  [["id", 1]]
---
  def destroy
    @publication.destroy

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def set_publication
    @publication = Publication.find(params[:id])