app/controllers/publications_controller.rb

  def destroy
    @publication.destroy
---
DELETE FROM "publications" WHERE "publications"."id" = ?  [["id", 20]]

  def set_publication
    @publication = Publication.find(params[:id])
---
SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]