app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @quote = Quote.find(params[:id])