app/controllers/quotes_controller.rb

  def create
    @quote = Quote.new(quote_params)
    @quote.user_id= current_user.id
    respond_to do |format|
      if @quote.save!
---
INSERT INTO "quotes" ("date", "phone", "message", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-02-25"], ["phone", 231312321321], ["message", "rewrew"], ["created_at", "2021-12-05 21:24:20.857178"], ["updated_at", "2021-12-05 21:24:20.857178"], ["user_id", 2]]

  def destroy
    @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 11]]