app/controllers/quotes_controller.rb

UPDATE "quotes" SET "message" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["message", "gola"], ["updated_at", "2021-12-05 23:29:01.207310"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 18]]
---
  def destroy
    @quote.destroy