app/controllers/users_controller.rb

  def update
    respond_to do |format|
        if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Fabian Salas"], ["updated_at", "2021-12-02 02:52:35.283580"], ["id", 2]]